[DefaultSabotageCC X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Plant X4 charges on the monument"
ObjectiveTextPools[1]="Extract all XCOM soldiers"

[DefaultDestroyRelay X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Destroy the Relay before transmission completes"
ObjectiveTextPools[1]="Extract all XCOM soldiers"

[DefaultRecover X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Recover %QUESTITEM%"
ObjectiveTextPools[1]="Extract %QUESTITEM%"
ObjectiveTextPools[2]="Extract all XCOM soldiers"

[DefaultRecover_ADV X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Recover %QUESTITEM%"
ObjectiveTextPools[1]="Extract %QUESTITEM%"
ObjectiveTextPools[2]="Extract all XCOM soldiers"

[DefaultRecover_Train X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Recover %QUESTITEM% from ADVENT train"
ObjectiveTextPools[1]="Extract %QUESTITEM%"
ObjectiveTextPools[2]="Extract all XCOM soldiers"

[DefaultRecover_Vehicle X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Recover %QUESTITEM% from ADVENT vehicle"
ObjectiveTextPools[1]="Extract %QUESTITEM%"
ObjectiveTextPools[2]="Extract all XCOM soldiers"

[DefaultHack X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Download %QUESTITEM% from exposed access point"
ObjectiveTextPools[1]="Extract all XCOM soldiers"

[DefaultHack_ADV X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Download %QUESTITEM% from exposed access point"
ObjectiveTextPools[1]="Extract all XCOM soldiers"

[DefaultHack_Train X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Download %QUESTITEM% from exposed access point"
ObjectiveTextPools[1]="Extract all XCOM soldiers"

[DefaultProtectDevice X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Protect Data Interceptor Device"
ObjectiveTextPools[1]="Extract all XCOM soldiers"

[DefaultTerror X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Rescue at least 6 Civilians from Alien Forces"
ObjectiveTextPools[1]="Extract all XCOM soldiers"

[DefaultSupplyRaidATT X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Raid the Advent Troop Transport Base for Supplies"
ObjectiveTextPools[1]="Extract all XCOM soldiers"

[SupplyLineRaidTrain X2MissionTemplate]
ObjectiveTextPools[0]="Raid the ADVENT train for Supplies"
ObjectiveTextPools[1]="Extract all XCOM soldiers"

[DefaultSecureUFO X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Raid the Landed UFO for Supplies"
ObjectiveTextPools[1]="Deactivate enemy Distress Beacon"
ObjectiveTextPools[2]="Extract all XCOM soldiers"

[SupplyLineRaidConvoy X2MissionTemplate]
ObjectiveTextPools[0]="Raid the ADVENT convoy for Supplies"
ObjectiveTextPools[1]="Extract all XCOM soldiers"


[MissionTimers]
TimerProtectTitle="Data Interception"
TimerProtectSubtitle="Turns until complete"

[UIInventory_LootRecovered]
m_strArtifactRecoveredEvac="Alien Artifacts carried out of the mission site:"


[FultonHarness X2WeaponTemplate]
FriendlyName="Fulton Harness"
FriendlyNamePlural="Fulton Harnesses"
BriefSummary="The Fulton Harness allows you to extract units and supplies from the combat zone without an Evacuation Zone."
TacticalText="The Fulton Harness allows you to extract units and supplies from the combat zone without an Evacuation Zone."

[DeployFultonHarness X2AbilityTemplate]
LocFriendlyName="Deploy Fulton Harness"
LocHelpText="Extract unit/supplies from combat zone."